# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 

a = 5
print(type(a))
a = 'hello world'
print(type(a))
a = 42.0 * 3.1454255 / 2.71828
print(type(a))


